#ifndef CHECKSUM_H_HEADER_INCLUDED_B9AF0177
#define CHECKSUM_H_HEADER_INCLUDED_B9AF0177
#include "Binary.h"
#include "ErrorCode.h"

/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co
  
    All rights reserved.

    文件名称：CheckSum.h CheckSum.cpp

    档 标 识：

    摘    要：数据帧校验和计算及处理


    用途：实现发送帧校验和计算
    

    历史记录：
    ---------------------------------------------------------------------------
     时     间       作者    版本号      操    作    内    容
    ---------------------------------------------------------------------------
     2007.5.20       王长喜    1.0      创建此类
     2007.7.6        王长喜    1.0      编写代码, 并在PC下编译通过(不含GetCrcValue())

*******************************************************************************/
class CCheckSum
{
  public:
    /*
    CS_NONE             -- 无校验
    CS_ADD              -- 累加和
    CS_ADD_REVERSE      -- 累加和取反
    CS_ADD_COMPLEMENT   -- 累加和取补
    CS_ADD_HL           -- 双字节累加和，高位字节在前，低位字节在后
    CS_XOR              -- 异或
    CS_CRC              -- CRC校验
    CS_1281             -- 1281结束字符
	CS_HINOBOSCH        -- Hino结束字符
    */
    enum tagMode {
        CS_NONE             = 0,
        CS_ADD              = 1,
        CS_ADD_REVERSE      = 2,
        CS_ADD_COMPLEMENT   = 3,
        CS_ADD_HL           = 4,
        CS_ADD_LH           = 5,
        CS_XOR              = 6,
        CS_CRC              = 7,
        CS_1281             = 8,
		CS_HINOBOSCH		= 9
    };

    /*-----------------------------------------------------------------------------
      功    能：设置校验和计算更新方式
      参数说明：W_U8 u8Mode -- 模式字
                W_U32 u32CyclicPolynomial -- CRC方式的CRC多项式，缺省为0
                        CRC校验多项式，如为X8+X4+X3+X2+1则表示为：0100011101b
      返 回 值：错误代码
      说    明：如为累加和、校验字为一个字节、替换数据帧中最后字节，则方式字设为：
                CCW_ADD|CSUW_REPLACE|CSBN_ONE
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetMode(W_U8 u8Mode, W_U32 u32CyclicPolynomial = 0x11D);

    /*-----------------------------------------------------------------------------
      功    能：删除校验和字节
      参数说明：CBinary bin -- 需删除校验和的数据帧
      返 回 值：更新后的数据帧
      说    明：无
    -----------------------------------------------------------------------------*/
	CBinary DeleteCS(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：添加校验和
      参数说明：CBinary bin -- 需加校验和的数据帧
      返 回 值：更新后的数据帧
      说    明：按照设定计算校验和并返回结果帧
    -----------------------------------------------------------------------------*/
	CBinary AppendCS(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：实现校验和计算功能
      参数说明：CBinary& bin -- 更新CS数值
      返 回 值：更新后的数据帧
      说    明：按照设定计算校验和并返回结果帧
    -----------------------------------------------------------------------------*/
    CBinary UpdateCS(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：构造函数
      参数说明：W_U8 uMode -- 校验和计算模式字
                W_U32 u32CyclicPolynomial -- CRC方式的CRC多项式，缺省为X8+X4+X3+X2+1,表示为：0100011101b
      返 回 值：无
      说    明：如为累加和、校验字为一个字节、替换数据帧中最后字节，则方式字设为：
                CCW_ADD|CSUW_REPLACE|CSBN_ONE
    -----------------------------------------------------------------------------*/
    CCheckSum(W_U8 uMode, W_U32 u32CyclicPolynomial = 0x11D);
    CCheckSum();
    virtual ~CCheckSum();

  private:
    // 校验和计算模式
    W_U8 m_uMode;

    //CRC多项式，如为 X8+X4+X3+X2+1 则表示为：0100011101b
    W_U32 m_uCyclicPolynomial;

protected:
    W_U16 GetCrcValue(CBinary bin);
};


#endif /* CHECKSUM_H_HEADER_INCLUDED_B9AF0177 */
