#ifndef PACKUNPACK_H_HEADER_INCLUDED_B97CA626
#define PACKUNPACK_H_HEADER_INCLUDED_B97CA626
#include "Binary.h"
#include "CheckSum.h"
#include "SendFrame.h"
#include "ReceiveFrame.h"
#include "MultiSendFrame.h"
#include "MultiReceiveFrame.h"

#include <string>
using namespace std;
/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co

    All rights reserved.

    文件名称：PackUnpack.h PackUnpack.cpp

    档 标 识：

    摘    要：数据格式说明如下
              CHRYSLER  req: B2  43  24  01  00  1A                  1 BYTE头(0xB2)+内容+CS(1字节ADD)  CCD
                        anw: F2  43  24  AC  06  0B
              FORD_PWM  req:0xC4,0x10,0xF2,0x22,0x02,0x00,0xAF,      1 BYTE头(0xC4)+目标+源+内容+CRC(1字节)
                        anw:0xC4,0xF2,0x10,0x62,0x02,0x00,0x03,0x55
              FORD_ISO  req:0x64,0xc1,0xf2,0x22,0x02,0x00,0x3B,      ((长度+1)<<4)|0x04+目标+源+内容+CS(1 BYTE ADD)
                        anw:0x94,0xF2,0xc1,0x7F,0x22,0x02,0x00,0x00,0x00,0x63,
              Honda     req: 25 05 73 01 62                          头(25)+长度+内容+CS(1 BYTE ADD_RE_INC)
                        005: 05 0c 73 01 00 00 00 00 00 00 00 7b       头(05)+长度+内容+CS(1 BYTE)
              Mit       Req: fe                                      内容(1 BYTE)
                        Ans: 23                                      内容(1 BYTE)
                        Req: ff                                      内容(1 BYTE)
                        Ans: e0                                        内容(1 BYTE)
             Nissan     Req:  d1                                     内容(1 BYTE)
                        Ans： 2f                                     内容(1 BYTE)
                        Req:  f0                                     内容(1 BYTE)
                        002:  ff  05  01  02  03  04  05             头(0xFF)+(长度-2)+内容"    必须不断改变长度识别方式
             KWP        格式：KWP_00, KWP_0X, KWP_80，KWP_8X，KWP_CX
                        KWP_1   01 A3 A4                               (长度-2)+内容+CS
                        KWP_2   00 01 A3 A4                            头(0x00)+(长度-3)+内容+CS
                        KWP_3   81  11  f1  81  04                     长度(0x80+长度-4)+目标+源+内容+CS(1字节)
                        KWP_4   80  11  f1  02  1a  81  1f             头(0x80)+目标+源+(长度-5)+内容+CS(1字节)
             ISO9141    req: 68 6A F1 01 00 C4                       头(68 6A)+源+内容+CS   ADD
                        ans：48 6b 10 41 00 ff ff ff ff CS
             OBD_VPW    req:  68 6A F1 01 00 17        头(68 6A)+源+内容+CS   CRC
                              48 6b 10 41 00 ff ff ff ff CS
             KW_81      req: 02  07  f7         CS_ADD_COMPLEMENT
             KW_82      req: 02  b0  00  b2                          (长度-2)+内容+CS(2字节 ADD_HL)    可做为一般格式处理
                        003: 06  f0  aa  10  5e  05  02  13
             ALDL       Req:FA 57 01 00 AE                           头(FA)+((长度+2)|0x50)+内容+CS(1字节 )  CS_ADD_COMPLEMENT
             VOLVO      Req: 83 7A 13 B9 F0 B9
                        8x模式:Ans: 92 13 7A F9 F0 00 09 12 58 18 30 30 31 09 12 58 19 30 30 31 41 (81+长度-4)+目+源+内容+CS  ADD
						80模式:
							   Ans: 80 13 7A 24 
									EE 01 00 00 00 00 00 00 01 00 00 00 00 00 02 00 00 00 00 00 03 00 00 00 00 00 04 00 00 00 
									00 00 05 00 00 00 00 00 06 00 00 00 00 00 07 00 00 00 00 00 08 00 00 00 00 00 09 00 00 00 
									00 00 0A 00 00 00 00 00 0B 00 00 00 00 00 0C 00 00 00 00 00 0D 00 00 00 00 00 0E 00 00 00 
									00 00 0F 00 00 00 00 00 98
									头(0x80)+目标+源+(长度-4-63)+内容+CS(1字节) ADD
             KW1281     Request：03      01       09      03         长度+计数器+内容+03
                                 ↓      ↓       ↓      ↓
                               Length  Count  ReqWord    End
                        Answer： 03      02       09      03
                                 ↓      ↓       ↓      ↓
                               Length  Count  AnsWord    End
             Rover BMW      req: 12  04  9e  88                           头(12)+长度+内容+CS(1BYTE)    XOR
                        001: 12  04  a0  b6
             PSA        Req:0x82,0x00,0x7d                            (80+长度-1)+内容+CS CS_ADD_REVERSE
                        Ans:0xc2,0x00,0x3d
             OBD2-PWM   Req: 61 6a f1 01 00 0A
                        Ans: 41 6b 10 41 00 ff ff ff ff CRC"
             MB_ISO     20 10 00  ->  20 10 06 00 36 00              06为长度，36 00为累加和
             PF_RENAULT_ISO                                          长度 + 内容 + CS(1BYTE CS_ADD)
                        req: 03  31  50  84
                        001: 0E  31  50  01  08  5A  42  4D  00  0A  16  5F  59  08  61  61
             PF_J2190_VPW
                        Req: 24 18 21 00 01 00 d9                    0x24 + 内容 + CS_CRC
                        Ans: 26 18 7f 21 12 00 ce                    0x26 + 内容 + CS_CRC
             PF_GM_VPW
                        Req: 6C 28 F1 19 02 FF 00 BD                 0x6C + 目标 + 源 + 内容 + CRC
                        Ans: 6C F1 28 59 01 02 D8                    0x6C + 目标 + 源 + 内容 + CRC

    用途：本类用于对ECU通信数据包进行打包与解包


    历史记录：
    ---------------------------------------------------------------------------
     时     间        作者    版本号      操    作    内    容
    ---------------------------------------------------------------------------
     2007.5.20       王长喜    1.0      创建此类
     2007.7.25~25    王长喜    1.0      编写代码, 并在PC下编译通过
     2007.12.3       班洪立    1.0      改PF_ALDL的头为EcuID
     2007.12.3       班洪立    1.0      增加PF_GM_VPW模式
     2008.4.17       班洪立    1.0      修改了MB_ISO模式
     2007.11.1       王长喜    1.0      修改GetEcuId(CBinary bin),在数据非法时，
                                        设置错误代码

*******************************************************************************/
class CPackUnpack
{
  public:
    /*
        PF_NONE    -- 无格式设定，即无打包也无解解包处理
        PF_ISO9141 -- 标准ISO9141 格式
        PF_OBD_PWM -- OBD2 PWM 格式
        PF_OBD_VPW -- OBD2 VPW 格式
        PF_KWP1281 -- 标准KWP1281格式
        PF_KWP_00  -- 标准KWP以00开头打包格式，解包可支持任意KWP协议格式
        PF_KWP_0X  -- 标准KWP以0x0X开头打包格式，解包可支持任意KWP协议格式
        PF_KWP_80  -- 标准KWP以0x80开头打包格式，解包可支持任意KWP协议格式
        PF_KWP_8X  -- 标准KWP以0x8X开头打包格式，解包可支持任意KWP协议格式
        PF_KWP_C0  -- 标准KWP以0xC0开头打包格式，解包可支持任意KWP协议格式
        PF_KWP_CX  -- 标准KWP以0xCX开头打包格式，解包可支持任意KWP协议格式
        PF_KW81
        PF_KW82
        PF_CHRYSLER
        PF_FORD_PWM
        PF_FORD_ISO
        PF_HONDA
        PF_MIT
        PF_NISSAN
        PF_ALDL
        PF_VOLVO
        PF_ROVER
        PF_PSA
        PF_MB_ISO
        PF_RENAULT_ISO
        PF_J2190_VPW
        PF_GM_VPW  -- 通用VPW
		PF_ATECH_MODE1 -- ATECH 模式1,00 + 00 + 0F + CS(第一个00为头,第二个00为有效为个数减1;0F为有效位，控制位从有效为算起，从0开始(cs采用CRC校验）//add jar 2011-01-04
		PF_ATECH_MODE2 -- ATECH 模式2,05 + e2 + 81 + aa + cs(第一个字节为长度(含本身),第二个字节为ECU地址,第三四字节为命令字，第五四个字节为校验(累加和取反+1)//add jar 2011-01-04
		PF_DAIHATSUISO -- DAIHATSUISO 大发ISO协议 03 E6 E9(第一个字节为长度,第二个字节为命令字,第三个字节为校验(累加和)//jar add 2011-1-20
		PF_SMISO	   -- 西门子ISO协议02H + 36H + CS(第一个字节为长度(长度不包含本身),第二个字节为命令字,第三个字节为校验(累加和))//jar add 2011-02-14
		PF_CNG_O4_CRC2REVERSE --CNG欧IV协议  两字节长度 + 数据 + 两字节CRC校验					//jar add 2011-02-14
												例如：
												00  06  09  01  27  91
												00 06是该帧数据的长度，09 01是数据信息，27 91是CRC-16校验；

												校验算法：
													由于数据传送的时候每个字节低位在前，高位在后，在进行校验的时候，每个字节的高低位要反过来，例如0X06变成0X60，0X09变成0X90，0X01变成0X80，
													生成CRC-16的多项式为G(X)=X^16+X^15+X^2+1,即0X18005，
													那么需要校验的数据00  06  09  01变成00  60   90  80 经CRC-16校验后得到的
													结果为E4 89，再将这个结果反过来就是27  91
		PF_CNG_O3	   -- CNG 欧III协议   Req: 信息 + 校验和						//jar add 2011-02-14
										  Ans: 53 + 信息长度  +  信息  +  校验和
		PF_CNG_DFuel   -- CNG 双燃料协议  Req: 10 02 12
										  Ans: 82 01 83
		PF_ISO_4L88EGR -- 4L88发动机EGR系统协议	aa+75+功能ID+00+数据长度（该长度为该字节后的内容但不含校验字节）+命令字+校验和（长度字节后命令字节的累加和）（系统进入除外）
												55+7a+功能ID+00+数据长度+命令字+校验和

		PF_HINOBOSCH_0X  -- 标准KWP以0x0X开头打包格式，解包可支持任意KWP协议格式
		PF_HINOBOSCH_8X  -- 标准KWP以0x8X开头打包格式，解包可支持任意KWP协议格式
		PF_NORMAL  -- 一般格式
    */
    enum PackFormatId {
        PF_NONE        = 0,
        PF_ISO9141     = 1,
        PF_OBD_PWM     = 2,
        PF_OBD_VPW     = 3,
        PF_CAN         = 4,
        PF_KWP1281     = 5,
        PF_KWP_00      = 6,
        PF_KWP_0X      = 7,
        PF_KWP_80      = 8,
        PF_KWP_8X      = 9,
        PF_KWP_C0      = 10,
        PF_KWP_CX      = 11,
        PF_KW81        = 12,
        PF_KW82        = 13,
        PF_CHRYSLER    = 14,
        PF_FORD_PWM    = 15,
        PF_FORD_ISO    = 16,
        PF_HONDA       = 17,
        PF_MIT         = 18,
        PF_NISSAN      = 19,
        PF_ALDL        = 20,
        PF_VOLVO       = 21,
        PF_ROVER       = 22,
        PF_PSA         = 23,
        PF_MB_ISO      = 24,
        PF_RENAULT_ISO = 25,
        PF_J2190_VPW   = 26,
        PF_GM_VPW      = 27,
		PF_DSI         = 28,
		PF_LUCAS_ISO   = 29,
		PF_ATECH_MODE1 = 30,
		PF_ATECH_MODE2 = 31,
		PF_DAIHATSUISO = 32,
		PF_SMISO	   = 33,
		PF_CNG_O4_CRC2REVERSE = 34,
		PF_CNG_O3      = 35,
		PF_CNG_DFuel   = 36,
		PF_ISO_4L88EGR = 37,
		PF_CAN_TP16	   = 38,
		PF_HINOBOSCH_00= 39,
		PF_HINOBOSCH_8X= 40,
        PF_NORMAL      = 100
    };

    /*-----------------------------------------------------------------------------
      功    能：打包一帧发给ECU的数据
      参数说明：CBinary binCmd -- 一帧发给ECU的一帧无格式数据内容
      返 回 值：满足ECU通信格式要求的数据包
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary Pack(CBinary binCmd);

    /*-----------------------------------------------------------------------------
      功    能：打包一发送帧数据
      参数说明：CSendFrame SendFrame -- 无格式的发送帧
      返 回 值：打包后的发送帧
      说    明：无
    -----------------------------------------------------------------------------*/
    CSendFrame Pack(CSendFrame SendFrame);

    /*-----------------------------------------------------------------------------
      功    能：打包多发送帧数据
      参数说明：CMultiSendFrame MultiSendFrame -- 无格式的多发送帧
      返 回 值：打包后的多发送帧
      说    明：无
    -----------------------------------------------------------------------------*/
    CMultiSendFrame Pack(const CMultiSendFrame& MultiSendFrame);

    /*-----------------------------------------------------------------------------
      功    能：去除ECU回复数据格式
      参数说明：const CBinary& binEcuData -- ECU回复的一帧数据
      返 回 值：去除格式的ECU数据内容
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary Unpack(const CBinary& binEcuData);

    /*-----------------------------------------------------------------------------
      功    能：解包接收帧数据
      参数说明：CReceiveFrame& ReceiveFrame -- 需解包的接收帧
      返 回 值：解包后的接收帧
      说    明：无
    -----------------------------------------------------------------------------*/
    CReceiveFrame Unpack(const CReceiveFrame& ReceiveFrame);

    /*-----------------------------------------------------------------------------
      功    能：解包多接收帧数据
      参数说明：const CMultiReceiveFrame& MultiReceiveFrame -- 需解包的多接收帧
      返 回 值：解包后的多接收帧
      说    明：无
    -----------------------------------------------------------------------------*/
    CMultiReceiveFrame Unpack(const CMultiReceiveFrame& MultiReceiveFrame);

    /*-----------------------------------------------------------------------------
      功    能：取得接收帧数据中的ECU ID
      参数说明：CBinary bin -- 接收到的ECU数据
      返 回 值：ECU ID
      说    明：1. 如数据帧中不包含ECU ID 则返回0
                2. CAN协议--11bit ID最高位为0，低11bit有效
                          --29bit ID最高位为1，低29bit有效
                3. 其它协议有效值0~255
    -----------------------------------------------------------------------------*/
    W_U32 GetEcuId(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：设置校验和计算方式
      参数说明：CCheckSum CheckSum -- 校验方式
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void SetCheckSum(CCheckSum CheckSum);

	/*-----------------------------------------------------------------------------
	功    能：返回打包模式
	参数说明：
	返 回 值：W_U8 m_uMode
	说    明：无
	-----------------------------------------------------------------------------*/
	W_U8 GetMode();

    /*-----------------------------------------------------------------------------
      功    能：设置打包模式
      参数说明：W_U16 uWayCode -- 打包模式字
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetMode(W_U16 uMode);

    /*-----------------------------------------------------------------------------
      功    能：设置打包格式
      参数说明：string strMode -- 打包格式串
                    'H' -- Head
                    'L' -- Length
                    'E' -- Ecu id
                    'T' -- Tool id
                    'S' -- checkSum
                    'C' -- Contain
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetPackFormat(string strMode);

    /*-----------------------------------------------------------------------------
      功    能：设置打包长度字节计算参数
      参数说明：BYTE FixByte -- 帧长度字节固定值
                char chOffset -- 计算帧长度修正值
                BYTE ucShift -- 计算帧长度移位位数
      返 回 值：无
      说    明：实际长度字节 = FixByte|((打包前长度+chOffset)<<chShift)
    -----------------------------------------------------------------------------*/
    void SetLengthByteMode(BYTE FixByte, char chOffset, BYTE ucShift);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧的目标地址
      参数说明：W_U8 uEcuId -- 发送帧的目标地址
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void SetEcuId(W_U8 uEcuId);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧的源地址
      参数说明：W_U32 uToolId -- 发送帧的源地址，
                  CAN协议--11bit ID最高位为0，低11bit有效，其它位必须为0
                         --29bit ID最高位为1，低29bit有效，其它位必须为0
                  其它协议有效值0~255
      返 回 值：无
      说    明：必须先设置打包模式，再设置设置ID
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetToolId(W_U32 uToolId);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧的头
      参数说明：char* pHead -- 发送帧头缓冲区
                W_I8 iLengthBYTE -- 发送帧头长度
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetHead(char* pHead, W_I8 iLength);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧的头
      参数说明：CBinary binHead -- 发送帧头数据
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void SetHead(CBinary binHead);

    /*-----------------------------------------------------------------------------
      功    能：设置打包参数
      参数说明：CBinary binHead -- 发送帧头数据
                BYTE ucEcuId -- 发送帧的目标地址
                BYTE ucToolId -- 发送帧的源地址
                BYTE ucFixByte -- 帧长度字节固定值
                char chOffset -- 计算帧长度修正值
                BYTE ucShift -- 计算帧长度移位位数
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void SetPackParameter (CBinary binHead, W_U32 uEcuId, W_U32 uToolId, BYTE ucFixByte, char chOffset, BYTE ucShift);

    /*-----------------------------------------------------------------------------
      功    能：设置CAN参数
      参数说明：bool bIsFillSpaceByte -- 是否需要填充帧空白字节, 缺省为true
                BYTE ucFillByte -- 填充的字节内容，缺省为0xFF
      返 回 值：无
      说    明：填充字符仅0x00或0xFF有效
    -----------------------------------------------------------------------------*/
    void SetCanFillByte(bool bIsFillSpaceByte=true, BYTE ucFillByte=0xFF);

    CPackUnpack();
    virtual ~CPackUnpack();

protected:
    /*-----------------------------------------------------------------------------
      功    能：PSA格式打包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackPsa(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：一般格式打包
      参数说明：CBinary bin -- 需打包数据
      返 回 值：打包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary PackNormalFrame(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：一般格式解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackNormalFrame(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：KWP协议数据解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackKwp(CBinary bin);

	/*-----------------------------------------------------------------------------
      功    能：HinoBosch协议数据解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackHinoBosch(CBinary bin);

	CBinary UnpackCANTP16(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：MB_ISO协议数据打包
      参数说明：CBinary bin -- 需打包数据
      返 回 值：打包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary PackMbIso(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：MB_ISO协议数据解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackMbIso(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：CAN协议数据打包
      参数说明：CBinary bin -- 需打包数据
      返 回 值：打包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary PackCan(CBinary bin);
	/*-----------------------------------------------------------------------------
	功    能：Lucas Iso协议数据打包
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackLucasIso(CBinary bin);
	/*-----------------------------------------------------------------------------
	功    能：AtechMode1协议数据打包
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackAtechMode1(CBinary bin);     //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：AtechMode1协议数据校验
	参数说明：CBinary bin -- 需校验数据
	返 回 值：校验后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	BYTE GetAtechMode1Crc(CBinary bin);    //jar add 2011-11-21
	/*-----------------------------------------------------------------------------
	功    能：AtechMode2协议数据打包
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackAtechMode2(CBinary bin);     //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：DAIHATSU ISO协议数据打包
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackDaihatsuIso(CBinary bin);     //jar add 2011-01-20
	/*-----------------------------------------------------------------------------
	功    能：Lucas Iso协议数据解包
	参数说明：CBinary bin -- 需解包数据
	返 回 值：解包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackLucasIso(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：CAN协议数据解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary UnpackCan(CBinary bin);
	/*-----------------------------------------------------------------------------
	功    能：AtechMode1
	参数说明：CBinary bin -- 需解包数据
	返 回 值：解包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackAtechMode1(CBinary bin);       //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：AtechMode2
	参数说明：CBinary bin -- 需解包数据
	返 回 值：解包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackAtechMode2(CBinary bin);       //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：DAIHATSUISO
	参数说明：CBinary bin -- 需解包数据
	返 回 值：解包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackDaihatsuIso(CBinary bin);     //jar add 2011-01-20
	/*-----------------------------------------------------------------------------
	功    能：西门子ISO
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackSmIso(CBinary bin);     //jar add 2011-02-14
	/*-----------------------------------------------------------------------------
	功    能：西门子ISO
	参数说明：CBinary bin -- 需解包数据
	返 回 值：解包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackSmIso(CBinary bin);       //jar add 2011-01-04

	/*-----------------------------------------------------------------------------
	功    能：CNG O4 CRC_2_Reverse
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackCNGO4Crc2Reverse(CBinary bin);     //jar add 2011-02-14
	/*-----------------------------------------------------------------------------
	功    能：CNG O4 CRC_2_Reverse
	参数说明：CBinary bin -- 需解包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackCNGO4Crc2Reverse(CBinary bin);       //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：CNG O3
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackCNGO3(CBinary bin);     //jar add 2011-02-14;
	/*-----------------------------------------------------------------------------
	功    能：CNG O3
	参数说明：CBinary bin -- 需解包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackCNGO3(CBinary bin);       //jar add 2011-01-04
	/*-----------------------------------------------------------------------------
	功    能：CNG DFuel
	参数说明：CBinary bin -- 需打包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary PackCNGDFuel(CBinary bin);     //jar add 2011-02-14;
	/*-----------------------------------------------------------------------------
	功    能：CNG DFuel
	参数说明：CBinary bin -- 需解包数据
	返 回 值：打包后的数据
	说    明：无
	-----------------------------------------------------------------------------*/
	CBinary UnpackCNGDFuel(CBinary bin);       //jar add 2011-01-04

	CBinary PackIso4L88EGR(CBinary bin);     //jar add 2011-02-16

	CBinary UnpackIso4L88EGR(CBinary bin);       //jar add 2011-01-06
	
    CBinary PackHonda(CBinary bin);
    CBinary UnpackHonda(CBinary bin);

	/*---------------------------------------------------------------------------
	  功    能：VOLVO协议数据打包
      参数说明：CBinary bin -- 需打包数据
      返 回 值：打包后的数据
      说    明：无

	 --------------------------------------------------------------------------*/
	CBinary PackVolvo(CBinary bin);
	/*---------------------------------------------------------------------------
	  功    能：VOLVO协议数据解包
      参数说明：CBinary bin -- 需解包数据
      返 回 值：解包后的数据
      说    明：无

	 --------------------------------------------------------------------------*/
	CBinary UnpackVolvo(CBinary bin);
    
protected:
    BYTE m_aucCanFillByte[2];
    W_U8 m_uMode;
    char m_szPacketFormat[7];   //Head Length Ecu_id Tool_id Content checkSum
    BYTE m_aucHead[3];          //长度+头内容
    W_U32 m_uToolId;
    W_U8 m_uEcuId;

    #define FRAME_LENGTH_FIX_BYTE               0
    #define FRAME_LENGTH_OFFSET                 1
    #define FRAME_LENGTH_SHIFT                  2
    BYTE m_aucFrameLength[3];    //FixByte+Offset+Shift

    CCheckSum m_CheckSum;
};



#endif /* PACKUNPACK_H_HEADER_INCLUDED_B97CA626 */
