#ifndef APPLAYERBASE_H_HEADER_INCLUDED_B98099FF
#define APPLAYERBASE_H_HEADER_INCLUDED_B98099FF
#include "adsStd.h"
#include "NetLayerBase.h"

/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co

    All rights reserved.

    文件名称：AppLayerBase.h AppLayerBase.cpp

    档 标 识：《MaxScan详细设计说明书》

    摘    要：诊断应用层基类

    用途：


    历史记录：
    ---------------------------------------------------------------------------
     时     间    作者    版本号      操    作    内    容
    ---------------------------------------------------------------------------
     2007.6.25    王长喜  1.0         创建此类。

*******************************************************************************/
class CAppLayerBase
{
    #define ALM_DIAGNOSE                    0
    #define ALM_SCAN_SYSTEM                 1
    #define ALM_QUICK_READ_DTC              2
    #define ALM_QUICK_CLEAR_DTC             3
public:
/*
    enum ApplicationLayerFunctionMode {
        ALM_DIAGNOSE = 0,
        ALM_SCAN_SYSTEM = 0,
        ALM_QUICK_READ_DTC = 2,
        ALM_QUICK_CLEAR_DTC
    };
 */
    // Programer define
    // enum ProtocolMode { PM_KWP = 0, NORMAL_DIAGNOSE = 1, QUICK_READ_DTC = 2 };

    /*-----------------------------------------------------------------------------
      功    能：设置工作模式
      参数说明：W_U16 uMode -- 模式代码
      返 回 值：错误代码
      说    明：用于复用应用层使用，其值由诊断程序员自行定义
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode SetMode(W_U16 uMode);

    /*-----------------------------------------------------------------------------
      功    能：应用层入口
      参数说明：无
      返 回 值：错误代码
      说    明：使用诊断应用层的唯一调用入口
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode Entrance(W_U16 uMode = ALM_DIAGNOSE);

  protected:
    /*-----------------------------------------------------------------------------
      功    能：进入应用层首先调用本函数
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual void OnEnter();

    /*-----------------------------------------------------------------------------
      功    能：进入诊断系统
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode EnterSystem();

    /*-----------------------------------------------------------------------------
      功    能：显示系统功能菜单及相关处理过程
      参数说明：无
      返 回 值：退出处理否，退出--true, 不退出--false
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_I16 MenuAndProcess();

    /*-----------------------------------------------------------------------------
      功    能：退出系统
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode ExitSystem();

    /*-----------------------------------------------------------------------------
      功    能：退出诊断应用层时调本函数
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual void OnExit();

    /*-----------------------------------------------------------------------------
      功    能：读版本信息功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode ReadInformation();

    /*-----------------------------------------------------------------------------
      功    能：读故障码功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode ReadTroubleCode();

    /*-----------------------------------------------------------------------------
      功    能：清故障码功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode ClearTroubleCode();

    /*-----------------------------------------------------------------------------
      功    能：读数据流功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode DataStream();

    /*-----------------------------------------------------------------------------
      功    能：读冻结帧功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode FreezeFrame();

    /*-----------------------------------------------------------------------------
      功    能：动作测试功能
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    virtual W_ErrorCode ActiveTest();

  protected:
    // 用于同一应用层使用多种协议类型/或同一个完成多个ECU诊断时使用。
    W_U32 m_uMode;
    CNetLayerBase * m_pNetLayerBase;

  public:
      void SetNetLayer(CNetLayerBase *pNetLayerBase);
    CAppLayerBase();
    virtual ~CAppLayerBase();

};



#endif /* APPLAYERBASE_H_HEADER_INCLUDED_B98099FF */
