#ifndef KEEPLINK_H_HEADER_INCLUDED_B97DA0A9
#define KEEPLINK_H_HEADER_INCLUDED_B97DA0A9
#include "Binary.h"
#include "SendFrame.h"

/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co

    All rights reserved.

    文件名称：FilterOrFrameReceive.h FilterOrFrameReceive.cpp

    档 标 识：

    摘    要：链路保持与连接测试

    用    途：


    历史记录：
    ---------------------------------------------------------------------------
     时     间           作者    版本号   操    作    内    容
    ---------------------------------------------------------------------------
     2007-6-26           王长喜  1.0      创建此类。
     2007-7-12           班洪立  1.0      完成代码
     2008.11.6           王长喜  1.0      加入VOLOV CAN链路保持代码

*******************************************************************************/
class CKeepLink
{
public:
    /*-----------------------------------------------------------------------------
      功    能：设置/取消链路保持
      参    数：fKeepTime                   链路保持时间(单位:毫秒)
                KeepLinkFrame               链路保持帧
      返 回 值：无
      说    明：流程：
                1、如链路保持帧内容为空，或链路保持时间为0，则关闭链路保持
    -----------------------------------------------------------------------------*/
    void SetKeepLink(W_FLOAT fKeepTime, CSendFrame KeepLinkFrame);

    /*-----------------------------------------------------------------------------
      功    能：获得链路保持帧数据
      参    数：无
      返 回 值：链路保持帧数据
      说    明：无
    -----------------------------------------------------------------------------*/
    inline CBinary GetKeepLinkFrameData()
    {
        return m_sfKeepLinkFrame.GetFrameData();
    }

    /*-----------------------------------------------------------------------------
      功    能：取得保持链路类实例指针
      参    数：无
      返 回 值：保持连路类指针
      说    明：无
    -----------------------------------------------------------------------------*/
    static CKeepLink* GetCurrentKeepLink();

    /*-----------------------------------------------------------------------------
      功    能：构造函数
      参    数：无
      返 回 值：无
      说    明：1、关本定时器
                2、设置本函数地址到m_spCurrentKeepLink
    -----------------------------------------------------------------------------*/
    CKeepLink();
    virtual ~CKeepLink();

    /*-----------------------------------------------------------------------------
      功    能：如果需要则发送链路保持帧
      参    数：无
      返 回 值：无
      说    明：供CEcuInterface调用
    -----------------------------------------------------------------------------*/
    void SendKeepLinkIfNeed();

    /*-----------------------------------------------------------------------------
      功    能：标记最后一次通信结束的时间
      参    数：无
      返 回 值：无
      说    明：供链路保持用
    -----------------------------------------------------------------------------*/
    void MarkLastCommEndTime();

private:
    // 链路保持帧
    CSendFrame          m_sfKeepLinkFrame;

protected:
    // 当前链路保持对象的指针
    static CKeepLink*   m_spCurrentKeepLink;

    // 链路保持间隔计数值
    W_U32               m_ulIntervalTickCount;

    // 最后一次通信结束的计数值
    W_U32               m_ulLastCommEndTick;
};

#endif /* KEEPLINK_H_HEADER_INCLUDED_B97DA0A9 */
