#ifndef SENDFRAME_H_HEADER_INCLUDED_B97F540D
#define SENDFRAME_H_HEADER_INCLUDED_B97F540D
#include "adsStd.h"
#include "Binary.h"

/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co

    All rights reserved.

    文件名称：MultiSendFrame.h MultiSendFrame.cpp

    档 标 识：《MaxScan详细设计说明书》

    摘    要：处理并存贮发送帧

    用    途：


    历史记录：
    ---------------------------------------------------------------------------
     时     间    作者    版本号      操    作    内    容
    ---------------------------------------------------------------------------
     2007.6.26    王长喜  1.0         创建此类
     2007.6.29    王长喜  1.0         编写完成代码, 并在PC下编译通过

*******************************************************************************/
class CSendFrame
{
  public:
/*
      SF_AUTO_DISTINGUISH  -- 接收帧数据自动识别
      SF_REUTRN_ALWAYS     -- ECU不断回复，即回复无数帧
*/
      enum RECEIVE_FRAME_NUMBER {
          // 接收帧数据自动识别
          SF_AUTO_DISTINGUISH = 0xFF,
          // ECU不断回复
          SF_RETURN_ALWAYS = 0xFE
      };
    /*-----------------------------------------------------------------------------
      功    能：判断发送帧内容是否为空
      参数说明：无
      返 回 值：是--true, 否--false
      说    明：无
    -----------------------------------------------------------------------------*/
    bool IsEmpty();

    /*-----------------------------------------------------------------------------
      功    能：赋值
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void operator = (const CSendFrame& SendFrame);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧数据
      参数说明：CBinary binCmd -- 帧内容
                W_I16 iReceiveFrameNumber -- 接收帧数，缺省使用设定的接收帧数量
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetSendFrame(CBinary binCmd, W_I16 iReceiveFrameNumber = -1);

    /*-----------------------------------------------------------------------------
      功    能：设置发送帧数据
      参数说明：BYTE* pucCmd -- 帧内容
                W_I16 iLengthCBinary -- 帧内容长度
                W_I16 iReceiveFrameNumber -- 接收帧数，缺省使用设定的接收帧数量
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetSendFrame(BYTE* pucCmd, W_I16 iLength, W_I16 iReceiveFrameNumber = -1);

    /*-----------------------------------------------------------------------------
      功    能：取得接收帧内容
      参数说明：无
      返 回 值：接收帧内容
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary GetFrameData() const;

    /*-----------------------------------------------------------------------------
      功    能：取得接收帧数量
      参数说明：无
      返 回 值：接收帧数量
      说    明：无
    -----------------------------------------------------------------------------*/
    W_I16 GetReceiveFrameNumber() const;

    /*-----------------------------------------------------------------------------
      功    能：清空发送帧
      参    数：无
      返 回 值：无
      说    明：
    -----------------------------------------------------------------------------*/
    void Clear();

    /*-----------------------------------------------------------------------------
      功    能：设置接收帧数量
      参数说明：W_I16 iReceiveNumber -- 接收帧数量
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetReceiveFrameNumber(W_I16 iReceiveNumber);

    /*-----------------------------------------------------------------------------
      功    能：设置缺省接收帧数量
      参数说明：W_I16 iReceiveNumber -- 缺省接收帧数量
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetDefaultReceiveFrameNumber(W_I16 iReceiveNumber);

    CSendFrame();
    CSendFrame(CBinary binCmd, W_U8 uReceiveFrameNumber = 1);

    virtual ~CSendFrame();

  private:
    // 发送帧内容
    CBinary m_binFrameContain;

    // 接收帧数量
    W_U8 m_uReceiveFrameNumber;

    // 缺省接收帧数量
    /*static */W_U8 m_uDefaultReceiveNumber;

};



#endif /* SENDFRAME_H_HEADER_INCLUDED_B97F540D */
