#pragma once
#include "adsStd.h"
#include "Binary.h"
#include <vector>

/******************************************************************************

    Copyright (c) 2007, AUTEL Ltd,.Co

    All rights reserved.

    文件名称：MultiSendFrame.h MultiSendFrame.cpp

    档 标 识：《MaxScan详细设计说明书》

    摘    要：二进制类的数组，用于数据表组件的返回值

    用    途：


    历史记录：
    ---------------------------------------------------------------------------
     时     间    作者    版本号      操    作    内    容
    ---------------------------------------------------------------------------
     2007.6.27    王长喜  1.0         创建此类。
     2007.6.29    王长喜  1.0         完成实现代码
	 2011.12.07   颜家松  1.1		  修改Operator []定义，实现读写功能
*******************************************************************************/

class CBinaryGroup  
{
  public:
      void Clear();
    /*-----------------------------------------------------------------------------
      功    能：操作符+=，CBinary
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    void operator+=(CBinary const&right);

    /*-----------------------------------------------------------------------------
      功    能：追加内容
      参数说明：无
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode Append(CBinary bin);

    /*-----------------------------------------------------------------------------
      功    能：CBinary数量
      参数说明：无
      返 回 值：数量
      说    明：无
    -----------------------------------------------------------------------------*/
    W_I16 GetSize();

    /*-----------------------------------------------------------------------------
      功    能：取得一帧数数据
      参数说明：帧序号，0为起始
      返 回 值：帧内容
      说    明：无
    -----------------------------------------------------------------------------*/
    const CBinary operator[](W_I16 iSequence) const;

	CBinary& operator[](W_I16 iSequence);
    /*-----------------------------------------------------------------------------
      功    能：取得一帧数数据
      参数说明：帧序号，0为起始
      返 回 值：帧内容
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinary GetAt(W_I16 iSequence);

    /*-----------------------------------------------------------------------------
      功    能：设置一帧数数据
      参数说明：iSequence                   位置
                binData                     要设置的帧内容
      返 回 值：错误代码
      说    明：无
    -----------------------------------------------------------------------------*/
    W_ErrorCode SetAt(W_I16 iSequence, CBinary binData);

    /*-----------------------------------------------------------------------------
      功    能：赋值
      参数说明：无
      返 回 值：无
      说    明：无
    -----------------------------------------------------------------------------*/
    CBinaryGroup& operator=(const CBinaryGroup& right);

    CBinaryGroup();
    CBinaryGroup(const CBinaryGroup& right);
    virtual ~CBinaryGroup();

protected:
    /*-----------------------------------------------------------------------------
      功    能：CDataTable类赋值使用
      参数说明：const BYTE* pDataTableContain -- 查表得到的数据内容指针
      返 回 值：引用
      说    明：1、CDataTable友元函数
                2、指针内容格式一定要正确
                   格式 ::= <组数>+[[<数据长度>+ 数据内容 ]+...]
                       <组数> ::= 一个字节无符号数
                       <数据长度> ::= 后面数据内容的字节数，占二字节，高位在前，低位在后
                3、说明：小潘，如上述格式不正确请及时通知我修改！
    -----------------------------------------------------------------------------*/
    void operator=(BYTE* pDataTableContain);

protected:
    vector<CBinary> m_aContain;
    // 内容格式参见数据表存贮格式
//  CBinary m_binGroupContain;
};